from PIL import Image
import requests as re
import streamlit as st

st.set_page_config(page_title="Islamic Resources", page_icon="🕌", layout="wide")

st.header("Islamic Resources")
st.subheader("Assalamu Alaikum! I am Abu Tanim :wave:")

left_column, right_column = st.columns([2, 1]) 
with left_column:
    st.write(
        """
        Welcome to the Islamic Resources site. Here you can find various tools and content to help you on your Islamic journey.
        We provide resources such as Quran readings, prayer times, Hadith collections, and videos to improve your understanding of Islam.
    
 Islam is a way of life that revolves around a deep connection with Allah, the Creator, and a commitment to following the guidance revealed through the Quran and the teachings of Prophet Muhammad (s). It is a faith that emphasizes peace, submission to the will of Allah, and compassion for all of humanity.

 One of the most important practices in Islam is prayer (Salah). Muslims pray five times a day: at dawn (Fajr), midday (Dhuhr), afternoon (Asr), sunset (Maghrib), and night (Isha). Prayer serves as a direct connection between the Muslim and Allah, offering an opportunity to seek guidance, forgiveness, and express gratitude.            
 """)

with right_column:
    img = Image.open("images/mashjid.png")  
    img_resized = img.thumbnail((300, 300))  
    st.image(img, caption="", use_container_width=False)
st.write("---")
st.subheader("History of Islam")
left_column, right_column = st.columns([2, 1]) 
with left_column:
    st.write("""
ইসলামের ইতিহাস হলো ইসলামি সভ্যতার রাজনৈতিক, সামাজিক, অর্থনৈতিক, সামরিক এবং সাংস্কৃতিক বিকাশের ইতিহাস। ইসলামি সভ্যতা সপ্তম শতাব্দীতে আরব উপদ্বীপে উৎপত্তি লাভ করে এবং পরবর্তীতে বিশ্বের অনেক অংশে ছড়িয়ে পড়ে। অধিকাংশ ইতিহাসবিদ[১] বিশ্বাস করেন যে ইসলামের উৎপত্তি মক্কা ও মদিনায় সপ্তম শতাব্দীর শুরুতে মুহাম্মাদ এর মাধ্যমে।[২] মুহাম্মাদ হলেন ইসলামের নবী। তিনি মক্কায় জন্মগ্রহণ করেন এবং ৬১০ খ্রিস্টাব্দে তিনি আল্লাহর কাছ থেকে প্রথম ওহী লাভ করেন। তিনি মক্কা ও মদিনায় তার ধর্মপ্রচার শুরু করেন, যেখানে তিনি ইসলামের শিক্ষা প্রচার করেন। মুসলিমরা এই সময়কে ইব্রাহিমীয় নবীদের দ্বারা প্রেরিত মূল ধর্মে ফিরে আসার সময় হিসাবে বিবেচনা করে। ইব্রাহিমীয় নবী হলেন আদম, নূহ, ইব্রাহিম, মুসা, দাউদ, সুলায়মান এবং ঈসা। মুসলিমরা বিশ্বাস করেন যে এই নবীরা সকলেই একই ঈশ্বরের কাছ থেকে বাণী পেয়েছিলেন।[৩][৪][৫]

ঐতিহ্যগত বিবরণ অনুসারে,[২][৬] মুহাম্মাদ ৬১০ খ্রিস্টাব্দে, মুসলিমরা যেটিকে ঐশী বাণী বলে মনে করে তা গ্রহণ শুরু করেন। এই বাণীগুলোকে কুরআন বলা হয়, যা ইসলামের পবিত্র গ্রন্থ। কুরআন এক আল্লাহর প্রতি আত্মসমর্পণ, মহাবিচারের জন্য প্রস্তুতি এবং দরিদ্র ও অভাবীদের জন্য দানের আহ্বান জানায়।[৪] মুহাম্মাদ এর বাণী যখন অনুসারীদের (সাহাবাগণ) আকর্ষণ করতে শুরু করে, তখন তিনি মক্কার অভিজাতদের কাছ থেকে ক্রমবর্ধমান শত্রুতা এবং নির্যাতনেরও সম্মুখীন হন। মক্কার অভিজাতরা মুহাম্মাদ এর শিক্ষার দ্বারা তাদের ক্ষমতা এবং প্রভাব হুমকির মুখে পড়তে দেখেছিলেন।[৪] ৬২২ খ্রিস্টাব্দে মুহাম্মাদ ইয়াথরিব শহরে (বর্তমানে মদিনা নামে পরিচিত) হিজরত করেন। ইয়াথরিব ছিল একটি আরব শহর যা মুহাম্মাদ এর শিক্ষার প্রতি ইতিবাচক ছিল। মুহাম্মাদ ইয়াথরিবে একটি ইসলামী সম্প্রদায় প্রতিষ্ঠা করেন এবং আরব উপদ্বীপের অন্যান্য গোত্রগুলোকে ইসলামে ধর্মান্তরিত করতে শুরু করেন।[৭] ৬৩০ খ্রিস্টাব্দে মুহাম্মাদ মক্কায় বিজয় করেন[৮][৯] এবং সমস্ত মূর্তি ধ্বংস করার আদেশ দেন।[১০][১১] এই পদক্ষেপটি আরব উপদ্বীপে ইসলামের আধিপত্য প্রতিষ্ঠার ক্ষেত্রে একটি গুরুত্বপূর্ণ মাইলফলক ছিল। মুহাম্মাদ মৃত্যুবরণ করার সময় (১১ হিজরি/৬৩২ খ্রিস্টাব্দে), আরব উপদ্বীপের প্রায় সমস্ত গোত্রই ইসলামে ধর্মান্তরিত হয়েছিল।[১২] মুসলিম সম্প্রদায়ের নেতা হিসেবে তার উত্তরসূরি কে হবেন তা নিয়ে মতবিরোধ দেখা দেয়। এই মতবিরোধ রাশিদুন খিলাফতের দিকে পরিচালিত করে, যা ইসলামের প্রথম চারজন খলিফার শাসনকাল।[২][১৩][১৪][১৫]

১৩শ শতাব্দীর শুরুতে, দিল্লী সালতানাত দক্ষিণ এশিয়ার উত্তর অংশে একটি শক্তিশালী মুসলিম রাজ্য হিসাবে আবির্ভূত হয়। দিল্লী সালতানাত মুহাম্মাদ ঘুরির দ্বারা প্রতিষ্ঠিত হয়েছিল, যিনি ১১৯২ সালে তৃতীয় পাণ্ডব যুদ্ধে পরাজিত হওয়ার পর দক্ষিণ এশিয়ায় মুসলিম শাসন প্রতিষ্ঠা করেছিলেন। দিল্লী সালতানাত পরবর্তীতে দক্ষিণ এশিয়ার বৃহত্তম এবং সবচেয়ে শক্তিশালী মুসলিম রাজ্য হয়ে ওঠে। ১১শ এবং ১২শ শতাব্দীতে, তুর্কি রাজবংশগুলো আনাতোলিয়ায় (বর্তমান তুরস্ক) সার্বজনীন রোমান সাম্রাজ্যের কাছ থেকে জমি জয় করে নেয়। এই রাজবংশগুলোর মধ্যে রয়েছে রুম সালতানাত এবং আরতুকিদরা। রুম সালতানাত ছিল একটি শক্তিশালী মুসলিম রাজ্য যা কায়সারিয়ায় (বর্তমান কাইসেরি, তুরস্ক) অবস্থিত ছিল। আরতুকিদরা ছিল একটি তুর্কি রাজবংশ যা আনাতোলিয়ায় বেশ কয়েকটি রাজ্য প্রতিষ্ঠা করেছিল। ১৩শ এবং ১৪শ শতাব্দীতে, মঙ্গোল এবং তৈমুর লং-এর আক্রমণ এবং ব্ল্যাক ডেথের মহামারি মুসলিম বিশ্বের অনেক অংশকে দুর্বল করে দেয়। মঙ্গোলরা ১৩শ শতাব্দীতে পারস্য, মধ্য এশিয়া এবং মধ্যপ্রাচ্যের অনেক অংশ জয় করে নেয়। তৈমুর লং-এর আক্রমণও মুসলিম বিশ্বের অনেক অংশকে ধ্বংস করে দেয়। ব্ল্যাক ডেথের মহামারি মুসলিম বিশ্বের জনসংখ্যায় ব্যাপক হ্রাস ঘটায়। এই ঘটনাগুলো মুসলিম বিশ্বের প্রচলিত কেন্দ্রগুলোকে দুর্বল করে দেয় এবং নতুন শক্তির উত্থানের পথ তৈরি করে। তৈমুর লং-এর অধীনে, মধ্য এশিয়ায় একটি নতুন সংস্কৃতি ও শিল্পের বিকাশ ঘটে। এই সময়কালকে তৈমুরীয় রেনেসাঁ বলা হয়। তবে, এই সময়ে পশ্চিম আফ্রিকায় মালি সাম্রাজ্য ও দক্ষিণ এশিয়ায় বাংলা সালতানাতের মত শক্তিশালী মুসলিম শক্তিরও উথ্থান ঘটে।[১৬][১৭] মালি সাম্রাজ্য ছিল একটি শক্তিশালী আফ্রিকান সাম্রাজ্য যা ১৩শ থেকে ১৬শ শতাব্দী পর্যন্ত বিদ্যমান ছিল। মালি সাম্রাজ্যটি একটি প্রধান বিশ্ব অর্থনৈতিক শক্তি ছিল এবং উত্তর আফ্রিকা থেকে পশ্চিম আফ্রিকা পর্যন্ত বিস্তৃত ছিল। ১৩শ শতাব্দীতে, সিসিলি আমিরাত এবং অন্যান্য ইতালীয় অঞ্চল[১৮] থেকে মুসলিম মুরদের নির্বাসন এবং দাসত্বের পর, খ্রিস্টান বাহিনী রিকনকোয়েস্টার সময় ইসলামী ইবেরীয় উপদ্বীপকে ধীরে ধীরে জয় করে নেয়। রিকনকোয়েস্টা ছিল একটি যুদ্ধ যা খ্রিস্টানরা মুসলিমদের কাছ থেকে ইবেরীয় উপদ্বীপ পুনরুদ্ধার করার জন্য করেছিল। ১৬শ শতাব্দীতে, উসমানীয় তুরস্ক, মুঘল ভারত এবং সাফাভীয় সাম্রাজ্য, ইসলামী বন্দুকধারী যুগের রাষ্ট্রগুলো বিশ্ব শক্তি হিসেবে আবির্ভূত হয়। এই রাজ্যগুলো শক্তিশালী সামরিক বাহিনী এবং বিস্তৃত সাম্রাজ্য গড়ে তোলে।

১৯শ এবং ২০শ শতাব্দীর মধ্যে মুসলিম বিশ্বে ইউরোপীয় উপনিবেশবাদের উত্থান ঘটে। এই সময়ের মধ্যে, ইউরোপীয় শক্তিগুলো, যেমন ব্রিটেন, ফ্রান্স, স্পেন, পর্তুগাল, রাশিয়া এবং জার্মানি, মুসলিম বিশ্বের বেশিরভাগ অংশে উপনিবেশ গড়ে তোলে। এই উপনিবেশগুলোতে, ইউরোপীয় শক্তিগুলো তাদের নিজস্ব আইন, অর্থনীতি এবং সংস্কৃতি প্রবর্তন করে। দুই শতাব্দী ধরে, মুসলিম বিশ্বের বিভিন্ন দেশের মানুষ ইউরোপীয় শক্তির অধীনে থেকে স্বাধীনতা অর্জনের জন্য লড়াই করেছে। এই লড়াইগুলোর কিছু এখনও চলমান রয়েছে এবং অনেক মুসলিম দেশ এখনও স্বাধীনতা অর্জন করেনি। মুসলিম বিশ্বের বিভিন্ন অঞ্চলে এখনও সংঘাত চলছে। এই সংঘাতগুলোর মধ্যে রয়েছে ইসরায়েলি-ফিলিস্তিনি সংঘাত, কাশ্মীর সমস্যা, উইঘুর মুসলিম নিধন, মধ্য আফ্রিকান সংঘাত, বসনিয়া যুদ্ধ এবং মিয়ানমারের রোহিঙ্গা গণহত্যা। ১৯৭০-এর দশকে, তেলের দাম বৃদ্ধি পেলে গালফ কোঅপারেশন কাউন্সিলের আরব রাষ্ট্রগুলোর (বিশেষ করে বাহরাইন, কুয়েত, ওমান, কাতার, সৌদি আরব এবং সংযুক্ত আরব আমিরাত) অর্থনীতি বিকশিত হয়। এই তেল-সমৃদ্ধ দেশগুলো এখন বিশ্বের বৃহত্তম তেল উৎপাদক এবং রপ্তানিকারক। গালফ কোঅপারেশন কাউন্সিলের আরব রাষ্ট্রগুলো পুঁজিবাদী অর্থনীতিতে রূপান্তরিত হয়েছে। তারা মুক্ত বাণিজ্য এবং পর্যটনকে উৎসাহিত করছে।[১৯][২০]
 """)
with right_column:
    img3 = Image.open("images/history.png") 
    img_resized = img3.thumbnail((1500, 1500)) 
    st.image(img3, caption="", use_container_width=False)
st.write("---")
st.subheader("Masalah")
left_column, right_column = st.columns([2, 1]) 
with left_column:
    
    st.write(""" 
রোযার গুরুত্বপূর্ণ মাসাইল আলকাউসারে একাধিকবার লেখা হয়েছে। প্রথমবার লেখা হয়েছিল ফিকহ ও ফতোয়ার নির্ভরযোগ্য কিতাবসমূহের উদ্ধৃতিতে। একবার হাদীস ও আছারের কিতাবাদির হাওয়ালাও যোগ করা হয়েছে। এবার এই পদ্ধতি অবলম্বন করা হয়েছে যে, মাসআলা উল্লেখ করে মাসআলার সাথে সংশ্লিষ্ট কোনো না কোনো দলীল কিতাবুল্লাহ, সুন্নতে রাসূলুল্লাহ, আছারে সাহাবা, কিংবা অন্তত তাবেয়ী ইমামগণের ফতোয়া থেকে উল্লেখ করা হয়েছে। যদিও এই প্রবন্ধে সকল মাসআলা আলোচিত হয়নি তবুও এই প্রয়াস দ্বারা ইনশাআল্লাহ নিম্নোক্ত সুফলগুলো পাওয়া যাবে। ১. সাধারণ পাঠকগণ আশ্বস্তি লাভ করবেন যে, ফিকহে হানাফীর মুফতা বিহী মাসায়েল দলীলভিত্তিক, যদিও সাধারণ পাঠকের সুবিধার্থে ফিকহের প্রাথমিক পর্যায়ের কিতাবপত্রে দলীল উল্লেখ করা হয় না। ২. সাধারণ শিক্ষায় শিক্ষিত ঐ সব বন্ধুদের আগ্রহকে কিছুটা বিবেচনা করা যারা দলীলসহ মাসায়েল জানতে চান যদিও তাদের এই চিন্তাধারা পুরোপুরি সমর্থনযোগ্য নয়। কারণ দলীলের আলোকে সকল মাসআলা বোঝা তাদের জন্য সহজ নয়। এর জন্য তো উসূলুল ফিকহ ও কাওয়াইদুল ফিকহ-এর ইলম অপরিহার্য, তদ্রূপ দলীলের ভাষা সম্পর্কেও যথেষ্ট পান্ডিত্য প্রয়োজন। ৩. তালিবে ইলমদের মাঝে এই ধারা সৃষ্টি হওয়া আবশ্যক যে, তারা শামী ও আলমগীরীর মাসায়েল আহকামুল কুরআন, সীরাত ও সুন্নাহ, হাদীস ও আছার এবং ফিকহুস সালাফের কিতাবসমূহের সাথে তুলনা করে পাঠ করবেন। যাতে ফিকহে মুদাল্লাল ও ফিকহে মুকারানের সাথে তাদের মুনাসাবাত তৈরি হয়।-তত্ত্বাবধায়ক

মাসআলা : প্রত্যেক সুস্থ মস্তিষ্ক বালেগ মুসলিমের উপর রমযানের রোযা ফরয। আল্লাহ তাআলা বলেন-

فمن شهد منكم الشهر فليصمه

অর্থ : সুতরাং তোমাদের মধ্যে যে ব্যক্তিই এ মাস পাবে সে যেন অবশ্যই রোযা রাখে।-সূরা বাকারা : ১৮৫; ফাতাওয়া হিন্দিয়া ১/১৯৫; রদ্দুল মুহতার ২/৩৭২

মাসআলা : শাবানের ২৯ তারিখ দিবাগত সন্ধ্যায় চাঁদ দেখা প্রমাণিত হলে পরদিন থেকে রোযা রাখতে হবে। নতুবা শাবানের ৩০ দিন পূর্ণ করার পর রোযা রাখা শুরু করবে।

عن ابن عمر رضي الله عنه عن النبي صلى الله عليه وسلم أنه ذكر رمضان، فقال : لا تصوموا حتى تروا الهلال، ولا تفطروا حتى تروه.

আবদুল্লাহ ইবনে উমর রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘(রমযানের) চাঁদ না দেখা পর্যন্ত রোযা রাখবে না এবং (শাওয়ালের) চাঁদ না দেখা পর্যন্ত রোযা রাখা বন্ধ করবে না।’-সহীহ মুসলিম ১/৩৪৭

অন্য হাদীসে আছে, ‘(শাবানের ২৯ দিন পূর্ণ করার পর) তোমরা যদি রমযানের চাঁদ না দেখ তাহলে শাবান মাস ৩০ দিন পূর্ণ করবে।’-আলমুসান্নাফ, আবদুর রাযযাক হাদীস : ৭৩০১; আলবাহরুর রায়েক ২/২৬৩; ফাতাওয়া হিন্দিয়া ১/১৯৭

মাসআলা : আকাশ মেঘাচ্ছন্ন থাকলে  রোযা শুরুর জন্য এমন একজন ব্যক্তির চাঁদ দেখাই যথেষ্ট হবে, যার দ্বীনদার হওয়া প্রমাণিত কিংবা অন্তত বাহ্যিকভাবে দ্বীনদার।

হযরত আবদুল্লাহ ইবনে আববাস রা. বলেন, ‘একজন মরুবাসী ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট (রমযানের) চাঁদ দেখার সাক্ষ্য দিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞাসা করলেন, ‘তুমি কি একথার সাক্ষ্য দাও যে, আল্লাহ ছাড়া কোনো মাবুদ নেই এবং আমি আল্লাহর রাসূল?’ সে বলল, ‘হ্যাঁ।’ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন সকলকে রোযা রাখার নির্দেশ দিলেন।’-মুসতাদরাকে হাকিম ১/৪২৪; সুনানে আবু দাউদ ২৩৩৩; সুনানে নাসায়ী ২৪২২; মুসান্নাফে ইবনে আবী শায়বা ৯৫৫৭; আলবাহরুর রায়েক ২/২৬৩; রদ্দুল মুহতার ২/৩৮৫

মাসআলা : আকাশ পরিষ্কার থাকলে একজনের খবর যথেষ্ট নয়; বরং এত লোকের খবর প্রয়োজন, যার দ্বারা প্রবল বিশ্বাস জন্মে যে, চাঁদ দেখা গেছে। কেননা, যে বিষয়ে অনেকের আগ্রহ ও সংশ্লিষ্টতা থাকে তাতে দু’ একজনের খবরের উপর নির্ভর করা যায় না।-আলমুহীতুল বুরহানী ৩/৩৩৮; রদ্দুল মুহতার ৩/৩৮৮


মাসআলা : কোনো ব্যক্তি একাকী চাঁদ দেখেছে, কিন্তু তার সাক্ষ্য গৃহিত হয়নি, এক্ষেত্রে তার জন্য ব্যক্তিগতভাবে রোযা রাখা উত্তম, জরুরি নয়।

এক ব্যক্তি উমর ইবনুল খাত্তাব রা.-এর নিকট এসে বলল, ‘আমি রযমানের চাঁদ দেখেছি।’ উমর রা. জিজ্ঞাসা করলেন, ‘তোমার সাথে অন্য কেউ কি দেখেছে?’ লোকটি বলল, ‘না, আমি একাই দেখেছি।’ উমর রা. বললেন, ‘তুমি এখন কী করবে?’ লোকটি বলল, ‘(আমি একা রোযা রাখব না) সবাই যখন রোযা রাখবে আমিও তখন রোযা রাখব।’ উমর রা. তাকে বাহবা দিয়ে বললেন, ‘তুমি তো বড় ফিকহ ও প্রজ্ঞার অধিকারী।’-মুসান্নাফে আবদুর রাযযাক ৪/১৬৮; আলমুহাল্লা ৪/৩৭৮

ফুকাহায়ে কেরাম বলেন, এমন ব্যক্তির জন্য রোযা রাখা জরুরি না হলেও উত্তম হল রোযা রাখা।-বাদায়েউস সানায়ে ২/২২১

মাসআলা : শাবান মাসের ২৯ ও ৩০ তারিখে রোযা রাখবে না; না রমযানের নিয়তে না নফলের নিয়তে। অবশ্য যে পূর্ব থেকেই কোনো নির্দিষ্ট দিবসে (যথা  সোম ও মঙ্গলবার) নফল রোযা রেখে আসছে, আর ঘটনাক্রমে শাবানের ২৯ ও ৩০ তারিখে ঐ দিন পড়েছে তার জন্য এই তারিখেও নফল রোযা রাখা জায়েয।

عن أبي هريرة رضي الله عنه قال : نهي رسول الله عليه وسلم أن يتعجل شهر رمضان بصوم يوم أو يومين، إلا رجل كان يصوم صوما فيأتي ذلك على صومه.

নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা রমযান মাসের একদিন বা দুই দিন পূর্ব থেকে রোযা রেখো না। তবে কারো যদি পূর্ব থেকেই নির্দিষ্ট কোনো দিন রোযা রাখার অভ্যাস থাকে আর ঐ দিন উক্ত তারিখ পড়ে যায় তাহলে সে ঐ দিন রোযা রাখতে পারে।’-সহীহ বুখারী ১/১৫৬, হাদীস : ১৯১; মুসানাফে আবদুর রাযযাক ৪/১৫৮, হাদীস : ৭৩১৫; জামে তিরমিযী ২/৩২; রদ্দুল মুহতার ২/৩৮২; বাদায়েউস সানায়ে ২/২১৭

নিয়ত

মাসআলা : রোযার নিয়ত করা ফরয। নিয়ত অর্থ সংকল্প। যেমন মনে মনে এ সংকল্প করবে, আমি আল্লাহর সন্তুষ্টির উদ্দেশ্যে আগামী কালের রোযা রাখছি। মুখে বলা জরুরি নয়।

হাদীস শরীফে আছে, সকল আমল নিয়তের উপর নির্ভরশীল। সহীহ বুখারী ১/২; বাদায়েউস সানায়ে ২/২২৬

মাসআলা : ফরয রোযার নিয়ত রাতেই করা উত্তম।

উম্মুল মুমিনীন হাফসা রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন-

من لم يجمع الصيام قبل الفجر فلا صيام له.

যে ব্যক্তি ফজরের আগে রোযা রাখার নিয়ত করবে না তার রোযা (পূর্ণাঙ্গ) হবে না।-সুনানে আবু দাউদ ১/৩৩৩; আলবাহরুর রায়েক ২/২৫৯-২৬০; বাদায়েউস সানায়ে ২/২২৯

মাসআলা : রাতে নিয়ত করতে না পারলে দিনে সূর্য ঢলার প্রায় এক ঘণ্টা আগে নিয়ত করলেও রোযা হয়ে যাবে।

সালামা ইবনুল আকওয়া রা. বলেন, (আশুরার রোযা যখন ফরয ছিল তখন) রাূসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলাম গোত্রের একজন ব্যক্তিকে ঘোষণা করতে বললেন, ‘যে সকাল থেকে কিছু খায়নি সে বাকি দিন রোযা রাখবে। আর যে খেয়েছে সেও বাকি দিন রোযা রাখবে। কারণ আজ আশুরা-দিবস।’-সহীহ বুখারী ২০০৭

আবদুল করীম জাযারী রাহ. বলেন, কিছু লোক সকালে চাঁদ দেখার সাক্ষ্য দিল। তখন উমর ইবনে আবদুল আযীয রাহ. বললেন, ‘যে ব্যক্তি (ইতিমধ্যে কিছু) খেয়েছে সে বাকি দিন খাওয়া থেকে বিরত থাকবে। আর যে খায়নি সে বাকি দিন রোযা রাখবে।’-মুহাল্লা ৪/২৯৩; বাদায়েউস সানায়ে ২/২২৯; ফাতাওয়া হিন্দিয়া ১/১৯৬

মাসআলা : পুরো রমযানের জন্য একত্রে নিয়ত করা যথেষ্ট নয়; বরং প্রত্যেক রোযার নিয়ত পৃথক পৃথকভাবে করতে হবে। কারণ প্রতিটি রোযা ভিন্ন ভিন্ন আমল (ইবাদত)। আর প্রতিটি আমলের জন্যই নিয়ত করা জরুরি।

হাদীস শরীফে আছে, সকল আমল নিয়তের উপর নির্ভরশীল।-সহীহ বুখারী ১/২; আরো দেখুন : আলমুহাল্লা ৪/২৮৫; মাবসূত, সারাখসী ৩/৬০; ফাতাওয়া হিন্দিয়া ১/১৯৫

মাসআলা : রাতে রোযার নিয়ত করলেও সুবহে সাদিক পর্যন্ত পানাহার ও স্ত্রী-মিলনের অবকাশ থাকে। এতে নিয়তের কোনো ক্ষতি হবে না।

আল্লাহ তাআলা ইরশাদ করেছেন-

أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ

রমযানের রাতে তোমাদের জন্য স্ত্রী সম্ভোগ হালাল করা হয়েছে।-বাকারা ২ : ১৮৭

মাসআলা : নিয়তের সময় শুরু হয় পূর্বের দিনের সূর্যাস্তের পর থেকে। যেমন-মঙ্গলবারের রোযার নিয়ত সোমবার দিবাগত রাত তথা সূর্যাস্তের পর থেকে করা যায়। সোমবার সূর্যাস্তের পূর্বে মঙ্গলবারের রোযার নিয়ত করা যথেষ্ট নয়। কেননা, হাদীস শরীফে রাতে নিয়ত করার কথা বলা হয়েছে।-আলমুহীতুল বুরহানী ৩/৩৪৩; রদ্দুল মুহতার ২/৩৭৭

সাহরী """)
with right_column:
    img4 = Image.open("images/hadid.jpg")  
    img_resized = img.thumbnail((190, 190))  
    st.image(img4, caption="", use_container_width=False)
left_column, right_column = st.columns([2, 1]) 
with left_column:    
     st.write("""

মাসআলা : সাহরী খাওয়া সুন্নত। পেট ভরে খাওয়া জরুরি নয়, এক ঢোক পানি পান করলেও সাহরীর সুন্নত আদায় হবে।

হাদীস শরীফে আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-

تسحروا، فإن في السحور بركة.

 ‘তোমরা সাহরী খাও। কেননা, সাহরীতে বরকত রয়েছে।’-সহীহ মুসলিম ১/৩৫০

অন্য হাদীসে বলা হয়েছে, সাহরী খাওয়া বরকতপূর্ণ কাজ। সুতরাং তোমরা তা পরিত্যাগ করো না। এক ঢোক পানি দিয়ে হলেও সাহরী কর। কারণ যারা সাহরী খায় আল্লাহ তাআলা তাদের উপর রহমত বর্ষণ করেন এবং ফেরেশতারা তাদের জন্য রহমতের দুআ করেন।’-মুসনাদে আহমদ ৩/১২; মুসান্নাফে ইবনে আবী শায়বা, হাদীস : ৯০১০; সহীহ ইবনে হিববান, হাদীস ৩৪৭৬

মাসআলা : সুবহে সাদিকের কাছাকাছি সময় সাহরী খাওয়া মুস্তাহাব। তবে এত দেরি করা মাকরূহ যে, সুবহে সাদিক হয়ে যাওয়ার আশঙ্কা হয়।

আবদুল্লাহ ইবনে আববাস রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-

إنما معاشر الأنبياء أمرنا أن تعجل فطرنا وأن تؤخر سحورنا، قال الهيثمي رجاله رجال الصحيح.

 ‘সকল নবীকে সময় হওয়ার পরপরই ইফতার তাড়াতাড়ি করতে এবং সাহরী শেষ সময়ে খেতে আদেশ করা হয়েছে।’-আলমুজামুল আওসাত ২/৫২৬; মাজমাউয যাওয়াইদ ৩/৩৬৮

আমর ইবনে মায়মুন আলআওদী বলেন, ‘সাহাবায়ে কেরাম দ্রুত ইফতার করতেন আর বিলম্বে সাহরী খেতেন।’-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৫৯১; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৯০২৫

মাসআলা : দেরি না করে সূর্যাস্তের সাথে সাথে ইফতার করা মুস্তাহাব।

হাদীস শরীফে আছে,

لا يزال الناس بخير ما عجلوا الفطر.

 ‘যতদিন মানুষ দেরি না করে সূর্যাস্তের সঙ্গে সঙ্গে ইফতার করবে ততদিন তারা কল্যাণের উপর থাকবে।’-সহীহ বুখারী ১/২৬৩

মাসআলা : মাগরিবের নামায পড়ার আগেই ইফতার করে নিবে, যেন সূর্যাস্তের সাথে সাথে ইফতার করার সওয়াব পাওয়া যায়।

আনাস ইবনে মালিক রা. বলেন, ‘রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের নামায পড়ার আগে তাজা খেজুর দিয়ে ইফতার করতেন। তাজা খেজুর না পেলে শুকনা খেজুর দ্বারা। আর তাও না পেলে এক ঢোক পানি দ্বারা ইফতার করতেন।’

-সুনানে তিরমিযী, হাদীস : ৬৯২

মাসআলা : খেজুর দ্বারা ইফতার করা মুস্তাহাব। খেজুর না পেলে পানি দ্বারা ইফতার করবে।

من وجد تمرا فليفطر عليه ومن لا يفطر على ماء، فإن الماء طهور.

আনাস ইবনে মালিক রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘যার কাছে খেজুর আছে সে খেজুর দ্বারা ইফতার করবে। খেজুর না পেলে পানি দ্বারা ইফতার করবে। কেননা পানি হল পবিত্র।’-সুনানে তিরমিযী, হাদীস : ৬৯৪

আরো দেখুন : মুসান্নাফে আবদুর রাযযাক, হাদীস ৭৫৮৬

ইফতারের সময় দুআ

ইফতারের সময় দুআ কবুল হয় তাই এ সময় বেশি বেশি দুআ-ইস্তিগফার করতে থাকবে। বিশেষত এই দুআ করবে-

اَللهُمَّ إِنِّيْ أَسْأَلُكَ بِرَحْمَتِكَ الَّتِيْ وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِيْ. رواه ابن ماجه، وقال البوصيري في الزوائد : هذا هديث صحيح، ورجاله ثقات. 

হে আল্লাহ! আমি তোমার কাছে তোমার সেই রহমতের উসীলায় প্রার্থনা করছি যা সকল বস্ত্ততে পরিবেষ্টিত, তুমি আমাকে মাফ করে দাও।-সুনানে ইবনে মাজাহ পৃ. ১২৫, হাদীস : ১৭৫৩

আর ইফতার গ্রহণের সময় এ দুআ পড়বে-

اَللهُمَّ لَكَ صُمْتُ وَعَلىٰ رِزْقِكَ أَفْطَرْتُ.

হে আল্লাহ! আমি তোমার জন্যই রোযা রেখেছিলাম এবং তোমার রিযিক দ্বারাই ইফতার করলাম।-সুনানে আবু দাউদ হাদীস : ২৩৫৮

ইফতারের পর নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দুআ পড়তেন-

ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوْقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللهُ. رواه أبو داود، وصححه الحاكم في المستدرك، ولم يتعقبه الذهبي.

পিপাসা দূর হল, শিরা-উপশিরা সতেজ হল আর আল্লাহ তাআলা চান তো রোযার সওয়াব লিপিবদ্ধ হল।-সুনানে আবু দাউদ ১/৩২১, হাদীস : ২৩৫৭; মুসতাদরাকে হাকেম, হাদীস : ১৫৭৬

 

রোযা ভঙ্গের কারণসমূহ

যেসব কারণে কাযা ও কাফফারা উভয়টি জরুরি

মাসআলা : রমযানে রোযা রেখে দিনে স্ত্রী সহবাস করলে বীর্যপাত না হলেও স্বামী-স্ত্রী উভয়ের উপর কাযা ও কাফফারা ওয়াজিব হবে।

একটি দীর্ঘ হাদীসে আছে, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, আমি রোযা অবস্থায় স্ত্রী সহবাস করেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কাফফারা আদায়ের নির্দেশ দিয়েছেন। দেখুন : সহীহ বুখারী ৬৭০৯; জামে তিরমিযী ৭২৪; মুসান্নাফে আবদুর রাযযাক ৭৪৫৭; মুসনাদে আহমদ ২/২৪১

মুহাম্মাদ ইবনে কা’ব রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ ব্যক্তিকে (যে স্ত্রীসহবাসে লিপ্ত হয়েছিল) কাফফারা আদায়ের সাথে কাযা আদায়েরও আদেশ করেছিলেন।-মুসান্নাফে আবদুর রাযযাক, হাদীস ৭৪৬১; আলবাহরুর রায়েক ২/২৭৬

মাসআলা : রোযা রেখে স্বাভাবিক অবস্থায় ইচ্ছাকৃতভাবে পানাহার করলে কাযা ও কাফফারা উভয়টি জরুরি হবে।

হাদীস শরীফে আছে-

এক ব্যক্তি রমযানে রোযা রেখে (ইচ্ছাকৃতভাবে) পানাহার করল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আদেশ করলেন, যেন একটি দাস আযাদ করে বা দুই মাস রোযা রাখে বা ষাটজন মিসকীনকে খানা খাওয়ায়।-সুনানে দারাকুতনী ২/১৯১

ইমাম যুহরী রাহ. বলেন, ‘রমযানে রোযা রেখে যে ইচ্ছাকৃতভাবে পানাহার করবে তার হুকুম ইচ্ছাকৃতভাবে দিনে সহবাসকারীর অনুরূপ।’ অর্থাৎ তাকে কাযা ও কাফফারা উভয়টি আদায় করতে হবে।-মাবসূত, সারাখসী ৩/৭৩; আলবাহরুর রায়েক ২/২৭৬

মাসআলা : বিড়ি-সিগারেট, হুক্কা পান করলেও রোযা ভেঙ্গে যাবে এবং কাযা ও কাফফারা উভয়টি জরুরি হবে।-রদ্দুল মুহতার ৩/৩৮৫

এই মাসআলার দলীল বিষয়ক বিস্তারিত আলোচনার জন্য দেখুন : ঝাজরু আরবাবির রায়্যান আন শুরবিদ দুখান; তারবীহুল জিনান বিতাশরীহি হুকমি শুরবিদ দুখান, আল্লামা আবদুল হাই লাখনোবী রাহ.

মাসআলা : সুবহে সাদিক হয়ে গেছে জানা সত্ত্বেও আযান শোনা যায়নি বা এখনো ভালোভাবে আলো ছড়ায়নি এ ধরনের ভিত্তিহীন অজুহাতে খানাপিনা করলে বা স্ত্রী সহবাসে লিপ্ত হলে কাযা-কাফফারা দু’টোই জরুরি হবে।-সূরা বাকারা : ১৮৭; মাআরিফুল কুরআন ১/৪৫৪-৪৫৫
    """)
with right_column:
    img4 = Image.open("images/islam.png")  
    img_resized = img.thumbnail((180, 180))  
    st.image(img4, caption="", use_container_width=False)
left_column, right_column = st.columns([2, 1]) 
with left_column:    
     st.write("""

কাফফারা আদায়ের নিয়ম

মাসআলা : একটি রোযার জন্য দুই মাস ধারাবাহিকভাবে রোযা রাখতে হবে। কোনো কারণে ধারাবাহিকতা ছুটে গেলে পুনরায় নতুন করে রোযা রাখতে হবে। পেছনের রোযাগুলো কাফফারার রোযা হিসাবে ধর্তব্য হবে না। তবে মহিলাদের হায়েযের কারণে ধারাবাহিকতা নষ্ট হলে অসুবিধা নেই।

ইবরাহীম নাখায়ী রাহ. বলেন, ‘যার উপর কাফফারা হিসাবে  দুই মাস ধারাবাহিকভাবে রোযা রাখা জরুরি সে যদি মাঝে অসুস্থ হওয়ার কারণে রোযা রাখতে না পারে, তাহলে আবার নতুন করে রোযা রাখা শুরু করবে।’-আলমুহাল্লা ৪/৩৩১; মাবসূত, সারাখসী ৭/১৪; আলবাহরুর রায়েক ২/২৭৭; আলমুহীতুল বুরহানী ৫/১৯৬ 

যেসব কারণে শুধু কাযা করতে হয়্

মাসআলা : অযু বা গোসলের সময় রোযার কথা স্মরণ থাকা অবস্থায় অনিচ্ছাকৃতভাবে গলার ভেতর পানি চলে গেলে রোযা ভেঙ্গে যাবে। তাই রোযা অবস্থায় অযু-গোসলের সময় নাকের নরম স্থানে পানি পৌঁছানো এবং গড়গড়াসহ কুলি করবে না।

লাকিত ইবনে সাবিরা রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন-

بالغ في الاستنشاق، إلا أن تكون صائما.

 ‘(অযু-গোসলের সময়) ভালোভাবে নাকে পানি দাও তবে রোযা অবস্থায় নয়।’-সুনানে আবু দাউদ, হাদীস : ২৩৬৩ সুনানে তিরমিযী, হাদীস : ৭৮৫

সুফিয়ান সাওরী রাহ. বলেন, ‘রোযা অবস্থায় কুলি করতে গিয়ে অনিচ্ছাকৃতভাবে গলার ভেতর পানি চলে গেলে রোযা ভেঙ্গে যাবে এবং তা কাযা করতে হবে।-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৩৮০

আরো দেখুন : মুসান্নাফে ইবনে আবী শাইবা, হাদীস ৯৮৪৪-৯৮৪৭; ফাতাওয়া শামী ২/৪০১

মাসআলা : যা সাধারণত আহারযোগ্য নয় বা কোনো উপকারে আসে না, তা খেলেও রোযা ভেঙ্গে যাবে এবং কাযা করতে হবে। আবদুল্লাহ ইবনে আববাস রা. ও ইকরিমা রাহ. বলেন, ‘(পেটে) কোনো কিছু প্রবেশ করলে রোযা ভেঙ্গে যায়। কোনো কিছু বের হওয়ার দ্বারা রোযা ভাঙ্গে না।’-সহীহ বুখারী ১/২৬০ (তা’লীক); বাদায়েউস সানায়ে ২/২৫৫; রদ্দুল মুহতার ২/৪১০

মাসআলা : দাঁত থেকে রক্ত বের হয়ে যদি তা থুথুর সাথে ভেতরে চলে যায় তবে রক্তের পরিমাণ থুথুর সমান বা বেশি হলে রোযা ভেঙ্গে যাবে।-আলবাহরুর রায়েক ২/২৭৩; রদ্দুল মুহতার ২/৩৯৬

মাসআলা : হস্তমৈথুনে বীর্যপাত হলে রোযা ভেঙ্গে যাবে। আর এটা যে ভয়াবহ গুনাহের কাজ তা বলাই বাহুল্য।

হাদীস শরীফে কামেচ্ছা চরিতার্থ করা থেকে বিরত থাকাকে রোযার অংশ হিসেবে উল্লেখ করা হয়েছে। ইরশাদ হয়েছে, ঐ সত্ত্বার কসম, যার হাতে আমার জান। রোযাদারের মুখের গন্ধ আল্লাহ তাআলার নিকট মেশকের চেয়েও বেশি প্রিয় (আল্লাহ তাআলা বলেন,) রোযাদার আমার জন্য পানাহার করা থেকে এবং কামেচ্ছা চরিতার্থ করা থেকে বিরত থাকে।-সহীহ বুখারী ১/২৫৪; আলবাহরুর রায়েক ২/২৭২; ফাতাওয়া শামী ২/৩৯৯

মাসআলা : মুখে বমি চলে আসার পর  ইচ্ছাকৃতভাবে গিলে ফেললে রোযা ভেঙ্গে যাবে। যদিও তা পরিমাণে অল্প হয়।-আলবাহরুর রায়েক ২/২৭৪; আদ্দুররুল মুখতার ২/৪১৫

মাসআলা : রোযা অবস্থায় হায়েয বা নেফাস শুরু হলে রোযা ভেঙ্গে যাবে। পরে তা কাযা করতে হবে।

আবু সাঈদ খুদরী রা. থেকে বর্ণিত একটি দীর্ঘ হাদীসে আছে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতর বা ঈদুল আযহায় মহিলাদের লক্ষ্য করে বললেন-

أليس إذا حاضت لم تصل ولم تصم قلن بلى، قال : فذلك من نقصان دينها.

মহিলারা তো ঋতুস্রাবের সময় রোযা রাখতে পারে না এবং নামাযও পড়তে পারে না। এটা তোমাদের দ্বীনের অসম্পূর্ণতা।-সহীহ বুখারী ১/৪৪; শরহু মুখতাসারিত তহাবী ২/৪৪০; আননুতাফ ফিলফাতাওয়া ১০০

* পেটের এমন ক্ষতে ওষুধ লাগালে রোযা ভেঙ্গে যাবে, যা দিয়ে ওষুধ পেটের ভেতর চলে যায়। বিশেষ প্রয়োজনে এমন ক্ষতে ওষুধ লাগালে পরে সে রোযার কাযা করে নিতে হবে।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৪০২

* নাকে ওষুধ বা পানি দিলে তা যদি গলার ভেতরে চলে যায় তাহলে রোযা ভেঙ্গে যাবে এবং কাযা করতে হবে।

* মলদ্বারের ভেতর ওষুধ বা পানি ইত্যাদি গেলে রোযা ভেঙ্গে যাবে।

আবদুল্লাহ ইবনে আববাস রা. থেকে বর্ণিত-

ذكر عنده الوضوء من الطعام، قال الأعمش مرة والحجامة للصائم، فقال : إنما الوضوء مما يخرج وليس مما يدخل، وإنما الفطر مما دخل وليس مما خرج.

শরীর থেকে (কোনো কিছু) বের হলে অযু করতে হয়, প্রবেশ করলে নয়। পক্ষান্তরে রোযা এর উল্টো।  রোযার ক্ষেত্রে (কোনো কিছু শরীরে) প্রবেশ করলে রোযা ভেঙ্গে যায়, বের হলে নয় (তবে বীর্যপাতের প্রসঙ্গটি ভিন্ন)।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৪০২

মাসআলা : সুবহে সাদিকের পর সাহরীর সময় আছে ভেবে পানাহার বা স্ত্রীসঙ্গম করলে রোযা  ভেঙ্গে যাবে। তেমনি ইফতারির সময় হয়ে গেছে ভেবে  

সূর্যাস্তের পূর্বে ইফতার করে নিলে রোযা নষ্ট হয়ে যাবে।-আদ্দুররুল মুখতার ২/৪০৫; আলবাহরুর রায়েক ২/২৯১

মাসআলা : রোযা রাখা অবস্থায় ভুলবশত পানাহার করে রোযা নষ্ট হয়ে গেছে ভেবে ইচ্ছাকৃতভাবে পানাহার করলে রোযা নষ্ট হয়ে যাবে এবং কাযা করা জরুরি হবে।

* অনিচ্ছাকৃত বমি হওয়ার কারণে রোযা নষ্ট হয়ে গেছে মনে করে রোযা ভেঙ্গে ফেললে কাযা করতে হবে।

আউন রাহ. থেকে বর্ণিত, মুহাম্মাদ ইবনে সীরীন রাহ. রাত্র বাকি আছে ভেবে সাহরী খেলেন। তারপর জানতে পারলেন, তিনি সুবহে সাদিকের পর সাহরী করেছেন তখন তিনি বললেন, ‘আমি আজ রোযাদার নই।’ (অর্থাৎ আমাকে এ রোযার কাযা করতে হবে)।-মুসান্নাফে ইবনে আবী শাইবা ৬/১৪৯

আলী ইবনে হানযালা তার পিতা থেকে বর্ণনা করেন, তিনি রোযার মাসে ওমর রা.-এর নিকট ছিলেন। তার নিকট পানীয় পেশ করা হল। উপস্থিত লোকদের কেউ কেউ সূর্য ডুবে গেছে ভেবে তা পান করে ফেলল। এরপর মুয়াযযিন আওয়াজ দিল, আমীরুল মুমিনীন! সূর্য এখনো ডুবেনি। তখন ওমর রা. বললেন, ‘যারা ইফতারি করে ফেলেছে তারা একটি রোযা কাযা করবে। আর যারা ইফতারি করেনি তারা সূর্যাস্ত পর্যন্ত অপেক্ষা করুন।’-মুসান্নাফে ইবনে আবী শাইবা ৬/১৫০; আদ্দুররুল মুখতার ২/৪০১; ফাতাওয়া হিন্দিয়া ১/২০৬

যেসব কারণে রোযা ভাঙে না

এমন কিছু কাজ আছে, যার দ্বারা রোযার কোনো ক্ষতি হয় না। অথচ অনেকে এগুলোকে রোযা ভঙ্গের কারণ মনে করে। ফলে এমন কোনো কাজ হয়ে গেলে রোযা ভেঙে গেছে মনে করে ইচ্ছাকৃত পানাহার করে। পক্ষান্তরে কেউ কেউ এসব কাজ পরিহার করতে গিয়ে অযথা কষ্ট ভোগ করে। সুতরাং এসব বিষয়েও সকল রোযাদার অবগত হওয়া জরুরি।

মাসআলা : কোনো রোযাদার রোযার কথা ভুলে গিয়ে পানাহার করলে তার রোযা নষ্ট হবে না। তবে রোযা স্মরণ হওয়ামাত্রই পানাহার ছেড়ে দিতে হবে।

হাদীস শরীফে এসেছে-

من نسي وهو صائم فأكل أو شرب فليتم صومه، فإنما أطمعه الله وسقاه.

 ‘যে ব্যক্তি ভুলে আহার করল বা পান করল সে যেন তার রোযা পূর্ণ করে। কারণ আল্লাহই তাকে পানাহার করিয়েছেন।’-সহীহ মুসলিম ১/২০২; আলবাহরুর রায়েক ২/২৭১; ফাতাওয়া হিন্দিয়া ১/২০২

মাসআলা : চোখে ওষুধ-সুরমা ইত্যাদি লাগালে রোযার কোনো ক্ষতি হয় না।

আনাস রা. রোযা অবস্থায় সুরমা ব্যবহার করতেন।-সুনানে আবু দাউদ ১/৩২৩; ফাতাওয়া হিন্দিয়া ১/২০৩; রদ্দুল মুহতার ২/৩৯৫

মাসআলা : রাত্রে স্ত্রীসহবাস করলে বা স্বপ্নদোষ হলে সুবহে সাদিকের আগে গোসল করতে না পারলেও রোযার কোনো ক্ষতি হবে না। তবে কোনো ওযর ছাড়া, বিশেষত রোযার হালতে দীর্ঘ সময় অপবিত্র থাকা অনুচিত।

আয়েশা রা. থেকে বর্ণিত, তিনি বলেন, গোসল ফরয অবস্থায় নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সকাল হত। অতঃপর তিনি গোসল করে রোযা পূর্ণ করতেন।

মাসআলা : বীর্যপাত ঘটা বা সহবাসে লিপ্ত হওয়ার আশঙ্কা না থাকলে স্ত্রীকে চুমু খাওয়া জায়েয। তবে কামভাবের সাথে চুমু খাওয়া যাবে না। আর তরুণদের যেহেতু এ আশঙ্কা থাকে তাই তাদের বেঁচে থাকা উচিত।

আবদুল্লাহ ইবনে আমর ইবনুল আস রা. বলেন, আমরা নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে ছিলাম। ইতিমধ্যে একজন যুবক এল এবং প্রশ্ন করল, আল্লাহর রাসূল! আমি কি রোযা অবস্থায় চুম্বন করতে পারি? নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, না। এরপর এক বৃদ্ধ এল এবং একই প্রশ্ন করল। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হাঁ। আমরা তখন অবাক হয়ে একে অপরের দিকে তাকাচ্ছিলাম। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি জানি, তোমরা কেন একে অপরের দিকে তাকাচ্ছ। শোন, বৃদ্ধ ব্যক্তি নিজেকে নিয়ন্ত্রণ করতে পারবে।-মুসনাদে আহমদ ২/১৮০, ২৫০

আবু মিজলায রাহ. বলেন, আবদুল্লাহ ইবনে আববাস রা.-এর নিকট এক বৃদ্ধ রোযা অবস্থায় চুমু খাওয়ার মাসআলা জিজ্ঞাসা করল। তিনি তাকে অনুমতি দিলেন। অতঃপর এক যুবক এসে একই মাসআলা জিজ্ঞাসা করলে তিনি তাকে নিষেধ করলেন।-মুসান্নাফে আবদুর রাযযাক ৪/১৮৫; খুলাসাতুল ফাতাওয়া ১/২৬০; ফাতাওয়া হিন্দিয়া ১/২০০

মাসআলা : অনিচ্ছাকৃত বমি হলে (মুখ ভরে হলেও) রোযা ভাঙ্গবে না। তেমনি বমি মুখে এসে নিজে নিজে ভেতরে চলে গেলেও রোযা ভাঙ্গবে না।

হাদীস শরীফে আছে, অর্থ : অনিচ্ছাকৃতভাবে কোনো ব্যক্তির বমি হলে তার রোযা কাযা করতে হবে না।-জামে তিরমিযী ১/১৫৩, হাদীস : ৭২০; আলবাহরুর রায়েক ২/২৭৪; রদ্দুল মুহতার ২/৪১৪

মাসআলা : শরীর বা মাথায় তেল ব্যবহার করলে রোযা ভাঙ্গবে না।

কাতাদাহ রাহ. বলেন, ‘রোযাদারের তেল ব্যবহার করা উচিত, যাতে রোযার কারণে সৃষ্ট ফ্যাকাশে বর্ণ দূর হয়ে যায়।-মুসান্নাফে আবদুর রাযযাক ৪/৩১৩; আদ্দুররুল মুখতার ২/৩৯৫; আলবাহরুর রায়েক ২/১৭৩

মাসআলা : শুধু যৌন চিন্তার কারণে বীর্যপাত হলে রোযা ভাঙ্গবে না। তবে এ কথা বলাই বাহুল্য যে, সব ধরনের কুচিন্তা তো এমনিতেই গুনাহ আর রোযার হালতে তো তা আরো বড় অপরাধ।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৩৯৬

* কামভাবের সাথে কোনো মহিলার দিকে তাকানোর ফলে কোনো ক্রিয়া-কর্ম ছাড়াই বীর্যপাত হলে রোযা ভাঙ্গবে না। তবে রোযা অবস্থায় স্ত্রীর দিকেও এমন দৃষ্টি দেওয়া অনুচিত। আর অপাত্রে কু-দৃষ্টি তো গুনাহ। যা রোযা অবস্থায় আরো ভয়াবহ। এতে ঐ ব্যক্তি রোযার ফযীলত ও বরকত থেকে মাহরূম হয়ে যায়।

জাবির ইবনে যায়েদকে জিজ্ঞাসা করা হয়েছে, কোন ব্যক্তি তার স্ত্রীর দিকে কামভাবের সাথে তাকানোর ফলে বীর্যপাত ঘটেছে, তার কি রোযা ভেঙ্গে গেছে? তিনি বললেন, ‘না। সে রোযা পূর্ণ করবে।’-মুসান্নাফে ইবনে আবী শাইবা ৬-২৫৯ আরো দেখুন : সহীহ বুখারী ১/২৫৮; ফাতাওয়া হিন্দিয়া ১/২০৪; ফাতাওয়া শামী ২/৩৯৬

মাসআলা : মশা-মাছি, কীট-পতঙ্গ ইত্যাদি অনিচ্ছাকৃত পেটের ভেতর ঢুকে গেলেও রোযা ভাঙ্গবে না।

* অনুরূপ ধোঁয়া বা ধুলোবালি অনিচ্ছাকৃতভাবে গলা বা পেটের ভেতর ঢুকে গেলে রোযা ভাঙ্গবে না।

আবদুল্লাহ ইবনে আববাস রা. বলেন, ‘কারো গলায় মাছি ঢুকে গেলে রোযা ভাঙ্গবে না।’-মুসান্নাফে ইবনে আবী শাইবা ৬/৩৪৯; রদ্দুল মুহতার ২/৩৯৫; ফাতাওয়া হিন্দিয়া ১/২০৩

মাসআলা : স্বপ্নদোষ হলে রোযা ভাঙ্গবে না।

আবু সাঈদ খুদরী রা. থেকে বর্ণিত, নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখ ভরে বমি হল। তিনি তখন বললেন-

ثلاث لا يفطرن الصائم : القيء، والحجامة، والحلم.

তিন বস্ত্ত রোযাভঙ্গের কারণ নয় : বমি, শিঙ্গা লাগানো ও স্বপ্নদোষ।-সুনানে কুবরা, বাইহাকী ৪/২৬৪

মাসআলা : চোখের দু’ এক ফোটা পানি মুখে চলে গেলে রোযার ক্ষতি হয় না। তবে তা যদি গলার ভেতর চলে যায় তাহলে রোযা ভেঙ্গে যাবে।-আলমুহীতুল বুরহানী ৩/৩৪৯; ফাতাওয়া হিনিদয়া ১/২০৩

মাসআলা : সুস্থ অবস্থায় রোযার নিয়ত করার পর যদি অজ্ঞান বা অচেতন হয়ে যায় তাহলে রোযা নষ্ট হবে না।

নাফে রাহ. বলেন, আবদুল্লাহ ইবনে ওমর রা. নফল রোযা অবস্থায় বেহুশ হয়ে যান কিন্তু এ কারণে রোযা ভাঙ্গেননি।-সুনানে কুবরা, বাইহাকী ৪/২৩৫; আলমুহীতুল বুরহানী ৩/৩৬৮; মাবসূত, সারাখসী ৩/৮৮

যাদের জন্য রোযা না রাখার অনুমতি রয়েছে

১. মুসাফির

মাসআলা : মুসাফিরের জন্য সফরের হালতে রোযা না রাখার সুযোগ রয়েছে। তবে অস্বাভাবিক কষ্ট না হলে রোযা রাখাই উত্তম। আর অস্বাভাবিক কষ্ট হলে রোযা রাখা মাকরূহ। এ অবস্থায় রোযা না রেখে পরে তা কাযা করবে।

আছিম রাহ. বলেন, আনাস রা.কে সফরকালে রোযা রাখার বিষয়ে জিজ্ঞাসা করা হলে তিনি বললেন, ‘যে রোযা রাখবে না সে অবকাশ গ্রহণ করল। আর যে রোযা রাখল সে উত্তম কাজ করল।’-মুসান্নাফে ইবনে আবী শাইবা ৬/১৩২; রদ্দুল মুহতার ২/৪২১; ফাতাওয়া তাতারখানিয়া ৩/৪০৩

মাসআলা : সফরের হালতে রোযা রাখা শুরু করলে তা আর ভাঙ্গা জায়েয নয়। কেউ ভেঙ্গে ফেললে গুনাহগার হবে। তবে কাফফারা আসবে না। শুধু কাযাই যথেষ্ট।

আনাস রা. বলেন, ‘কেউ রোযা রেখে সফরে বের হলে রোযা ভাঙ্গবে না। তবে যদি পিপাসার কারণে প্রাণনাশের আশঙ্কা হয় তাহলে রোযা ভাঙ্গতে পারবে, পরে তা কাযা করে নিবে।-ফাতাওয়া তাতারখানিয়া ৩/৪০৩; রদ্দুল মুহতার ২/৪৩১

মাসআলা : মুসাফির সফরের কারণে রোযা রাখেনি, কিন্তু দিন শেষ হওয়ার আগেই মুকীম হয়ে গেল। তাহলে দিনের অবশিষ্ট সময় রমযানের মর্যাদা রক্ষার্থে পানাহার থেকে বিরত থাকা ওয়াজিব। তবে পরবর্তী সময়ে এ রোযার কাযা অবশ্যই করতে হবে।

ইবরাহীম নাখায়ী রাহ. বলেন, যে মুসাফির রমযানের দিনে (সফরের হালতে) খানা খেয়েছে সে মুকীম হয়ে গেলে দিনের বাকি অংশ পানাহার থেকে বিরত থাকবে।-মুসান্নাফে ইবনে আবী শাইবা ৬/২২১; আলবাহরুর রায়েক ২/২৯১; ফাতাওয়া তাতারখানিয়া ৩/৪২৮

মাসআলা : রমযানের দিনে হায়েয-নেফাস থেকে পবিত্র হলে অবশিষ্ট দিন রমযানের মর্যাদা রক্ষার্থে পানাহার থেকে বিরত থাকা ওয়াজিব। তবে উক্ত ওযরে ছুটে যাওয়া রোযাগুলোর সাথে এ দিনের রোযাও কাযা করবে।

হাসান রা. বলেন, ‘সুবহে সাদিকের পর যে হায়েয থেকে পবিত্র হয়েছে সে দিনের বাকি অংশে পানাহার করবে না।’-মুসান্নাফে ইবনে আবী শাইবা ৬/২২১; ফাতাওয়া তাতারখানিয়া ৩/৪২৮; আলবাহরুর রায়েক ২/২৯১

২. অসুস্থ ব্যক্তি

মাসআলা : রোযার কারণে যে রোগ বৃদ্ধি পায় বা রোগ-ভোগ দীর্ঘ হওয়ার প্রবল আশঙ্কা থাকে সে রোগে রোযা ভাঙ্গার অবকাশ আছে। উল্লেখ্য, আশঙ্কা যদি সুস্পষ্ট হয় তাহলে তো কথা নেই। নতুবা একজন অভিজ্ঞ ও দ্বীনদার চিকিৎসকের মতামতের প্রয়োজন হবে।-আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২

৩. গর্ভবতী

মাসআলা : রোযা রাখার কারণে গর্ভবতী মহিলা নিজের কিংবা সন্তানের প্রাণহানী বা মারাত্মক স্বাস্থ্যহানীর প্রবল আশঙ্কা করলে তার জন্য রোযা ভঙ্গ করা জায়েয। পরে এ রোযা কাযা করে নিবে।-আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২

৪. দুগ্ধদানকারিনী

মাসআলা : দুগ্ধদানকারিনী মা রোযা রাখলে যদি সন্তান দুধ না পায় আর ঐ সন্তান অন্য কোনো খাবারেও অভ্যস্ত না হয়, ফলে দুধ না পাওয়ার কারণে

সন্তানের মৃত্যুর বা মারাত্মক স্বাস্থ্যহানীর আশঙ্কা হয়, তাহলে তিনি রোযা ভাঙ্গতে পারবেন এবং পরে কাযা করে নিবেন। হাদীস শরীফে ইরশাদ হয়েছে, অর্থ : আল্লাহ তাআলা মুসাফিরের জন্য রোযার হুকুম শিথিল করেছেন এবং আংশিক নামায কমিয়ে দিয়েছেন। আর গর্ভবতী ও দুগ্ধদানকারিনীর জন্যও রোযার হুকুম শিথিল করেছেন।-জামে তিরমিযী ১/১৫২; আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২

৫. দুর্বল বৃদ্ধ ব্যক্তি

মাসআলা : বার্ধক্যজনিত কারণে রোযা রাখতে সক্ষম না হলে রোযা না রাখার অনুমতি রয়েছে। এক্ষেত্রে প্রত্যেক রোযার পরিবর্তে একজন গরীবকে দুবেলা খাবার খাওয়াবে অথবা পৌনে দু কেজি গমের মূল্য সদকা করবে।

আল্লাহ তাআলা বলেন-

وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ

আর যাদের রোযা রাখা অত্যন্ত কষ্টকর তারা ফিদয়া-একজন মিসকীনকে খাবার প্রদান করবে।-সূরা বাকারা : ১৮৪; আলমুহীতুল বুরহানী ৩/৩৬১; ফাতাওয়া হিন্দিয়া ১/২০৭

ফিদয়া""")
with right_column:
    img4 = Image.open("images/lamp.png")  
    img_resized = img.thumbnail((180, 180))  
    st.image(img4, caption="", use_container_width=False)   
left_column, right_column = st.columns([2, 1]) 
with left_column:    
     st.write("""

মাসআলা : যে বৃদ্ধ বা অসুস্থ ব্যক্তির রোযা রাখার সামর্থ্য নেই এবং পরবর্তীতে কাযা করতে পারবে এমন সম্ভাবনাও নেই এমন ব্যক্তি রোযার পরিবর্তে ফিদয়া প্রদান করবে।-সূরা বাকারা : ১৮৪

ছাবেত বুনানী রাহ. বলেন, আনাস ইবনে মালেক রা. যখন বার্ধক্যের কারণে রোযা রাখতে সক্ষম ছিলেন না তখন তিনি রোযা না রেখে (ফিদয়া) খাবার দান করতেন।-মুসান্নাফে আবদুর রাযযযাক, হাদীস : ৭৫৭০

ইকরিমা রাহ. বলেন, ‘‘আমার মা প্রচন্ড তৃষ্ণা-রোগে আক্রান্ত ছিলেন এবং রোযা রাখতে সক্ষম ছিলেন না। তাঁর সম্পর্কে আমি তাউস রাহ.কে জিজ্ঞাসা করলাম। তিনি বললেন, ‘প্রতি দিনের পরিবর্তে মিসকীনকে এক মুদ (বর্তমান হিসাবে পৌনে দুই কেজি) পরিমাণ গম প্রদান করবে’।’’-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৫৮১

মাসআলা : এক রোযার পরিবর্তে এক ফিদয়া ফরয  হয়। এক ফিদয়া হল, কোনো মিসকীনকে  দু বেলা পেট ভরে খানা খাওয়ানো অথবা এর মূল্য প্রদান করা।

হযরত সায়ীদ ইবনে মুসাইয়্যিব রাহ. বলেন-

وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ

এই আয়াত রোযা রাখতে অক্ষম বৃদ্ধের জন্য প্রযোজ্য।-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৫৮৫; আলমুহীতুল বুরহানী ৩/৩৬৯; আদ্দুররুল মুখতার ২/৪২৬

মাসআলা : যাদের জন্য রোযার পরিবর্তে ফিদইয়া দেওয়ার অনুমতি রয়েছে তারা রমযানের শুরুতেই পুরো মাসের ফিদয়া দিয়ে দিতে পারবে।-আদ্দুররুল মুখতার ২/৪২৭; আলবাহরুর রায়েক ২/২৮৭

মাসআলা : উপরোক্ত দুই শ্রেণীর মানুষ ছাড়া (অর্থাৎ দুর্বল বৃদ্ধ ও এমন অসুস্থ ব্যক্তি যার ভবিষ্যতে রোযার শক্তি ফিরে পাওয়ার সম্ভাবনা নেই।) আরো যাদের জন্যে রোযা ভাঙ্গা জায়েয আছে, (যেমন-মুসাফির, গর্ভবতী ও শিশুকে

স্তন্যদানকারিনী) তারা রোযা না রাখলে রোযার ফিদয়া দিবে না; বরং পরে কাযা করবে। আর ওযরের হালতে মৃত্যুবরণ করলে কাযা ও ফিদয়া কিছুই ওয়াজিব হবে না। অবশ্য ওযরের হালত শেষ হওয়ার পর, অর্থাৎ মুসাফির মুকীম হওয়ার পর, গর্ভবতী নারীর সন্তান ভূমিষ্ট হওয়া ও স্রাব বন্ধ হওয়ার পর এবং

স্তন্যদানকারিনী স্তন্যদান বন্ধ করার পর যদি মৃত্যুবরণ করে তাহলে ওযর শেষে যে কয়দিন সময় পেয়েছে সে কয়দিনের কাযা যিম্মায় আসবে। কাযা না করলে উক্ত দিনগুলির ফিদয়া প্রদানের অসিয়ত করে যেতে হবে।-আদ্দুররুল মুখতার ২/৪২৩-৪২৪; কিতাবুল হুজ্জাহ আলা আহলিল মাদীনাহ ১/২৫৫

হযরত আবদুল্লাহ ইবনে আববাস রা. বলেন, ‘গর্ভবতী নারী ও শিশুকে

স্তন্যদানকারিনীর জন্যে রমযানে রোযা না রাখার অবকাশ রয়েছে। তারা ফিদয়া আদায় করবে না; বরং রোযাগুলো কাযা করে নিবে।’-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭০৬৪

মাসআলা : ছুটে যাওয়া রোযার কাযা সম্ভব না হলে মৃত্যুর পূর্বে ফিদয়া দেওয়ার অসিয়ত করে যাওয়া জরুরি। অসিয়ত না করে গেলে ওয়ারিশরা যদি মৃতের পক্ষ থেকে ফিদয়া দেয় তবে আশা করা যায় যে, আল্লাহ তাআলা তা কবুল করবেন। তবে মৃতব্যক্তি অসিয়ত না করে গেলে সেক্ষেত্রে মিরাসের ইজমালী সম্পদ থেকে ফিদয়া দেওয়া হবে না। একান্ত দিতে চাইলে বালেগ ওয়ারিশগণ তাদের অংশ থেকে দিতে পারবে।-রদ্দুল মুহতার ২/৪২৪-৪২৫; ফাতাওয়া হিন্দিয়া ১/২০৭

মাসআলা : এক রোযার ফিদয়া একজন মিসকীনকে দেওয়া উত্তম। তবে একাধিক ব্যক্তিকে দিলেও ফিদয়া আদায় হয়ে যাবে। আর একাধিক ফিদয়া এক মিসকীনকে দেওয়া জায়েয।

আবদুল্লাহ ইবনে আববাস রা. বলেন, ‘যে বৃদ্ধ রোযা রাখতে সক্ষম নন তিনি রোযা না রেখে প্রতি দিনের পরিবর্তে একজন মিসকীনকে আধা সা’ (অর্থাৎ প্রায় পৌনে দুই কেজি) গম দিয়ে দেবেন।-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৫৭৪; আলবাহরুর রায়েক ২/৮৭; আদ্দুররুল মুখতার ২/৪২৭

রোযা মাকরূহ হওয়ার কারণসমূহ

মাসআলা : রোযা অবস্থায় কুলি করার সময় গড়গড়া করা এবং নাকের নরম অংশ পর্যন্ত পানি পৌঁছানো মাকরূহ।

লাকিত ইবনে সবিরা রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-

بالغ في الاستنشاق، إلا أن تكون صائما.

 (অযু-গোসলের) সময় ভালোভাবে নাকে পানি দাও, তবে রোযাদার হলে নয়।-জামে তিরমিযী, হাদীস: ৭৬৬; সুনানে আবু দাউদ ১/৩২২; মুসান্নাফে ইবনে আবী শায়বা, হাদীস : ৯৮৪৪; ফাতাওয়া তাতারখানিয়া ৩/৩৯৫; ফাতাওয়া হিন্দিয়া ১/১৯৯

মাসআলা : এমন কাজ করা মাকরূহ, যার দ্বারা রোযাদার নিতান্তই দুর্বল হয়ে পড়ে। যেমন শিঙ্গা লাগানো।-আলমুহীতুল

বুরহানী ৩/৩৫৬; ফাতাওয়া হিন্দিয়া ১/২০০

মাসআলা : রোযা অবস্থায় শরীর থেকে রক্ত বের হলে বা ইনজেকশন ইত্যাদি দ্বারা রক্ত বের করলে রোযা ভাঙ্গবে না। তবে ইচ্ছাকৃতভাবে এ পরিমাণ রক্ত বের করা মাকরূহ, যার দ্বারা রোযাদার খুব দুর্বল হয়ে যায়।

সাবেত আলবুনানী রাহ. বলেন, আনাস রা. কে জিজ্ঞাসা করা হল রোযার হালতে শিঙ্গা লাগানোকে আপনারা কি মাকরূহ মনে করতেন? তিনি বলেন, ‘না। তবে এ কারণে দুর্বল হয়ে পড়লে তা মাকরূহ হবে।’-সহীহ বুখারী, হাদীস ১৯৪০; আলমুহীতুল বুরহানী ৩/৩৫৬; রদ্দুল মুহতার ২/৩৯৫

মাসআলা : রোযার হালতে গীবত করলে, গালি-গালাজ করলে, টিভি-সিনেমা ইত্যাদি দেখলে, গান-বাদ্য শ্রবণ করলে এবং যে কোনো বড় ধরনের গুনাহে লিপ্ত হলে রোযা মাকরূহ হয়ে যায়। আর এ কাজগুলো যে সর্বাবস্থায় হারাম, তা তো বলাই বাহুল্য।

হাদীসে কুদসীতে আছে, আল্লাহ তাআলা ইরশাদ করেছেন-

إذا كان يوم صوم أحدكم فلا يرفث ولا يصخب.

 ‘তোমাদের কেউ যখন রোযা রাখে তখন সে যেন অশ্লীল কথা না বলে এবং শোরগোল, হট্টগোলে লিপ্ত না হয়।-সহীহ বুখারী হাদীস : ১৯০৪;

সুনানে আবু দাউদের রেওয়ায়েতে এ শব্দ রয়েছে, ‘রোযাদার যেন কোনো অন্যায়-অপরাধে লিপ্ত না হয়।’ হাদীস : ৩৩৬৩ (১/৩২২)

হযরত আবু হুরায়রা রা. বলেন, নবী  কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, যে ব্যক্তি মিথ্যা-প্রতারণা ও গুনাহের কাজ ত্যাগ করে না আল্লাহ তাআলার নিকট তার পানাহার থেকে বিরত থাকার কোনো মূল্য নেই।’-সহীহ বুখারী, হাদীস ১৯০৩; সুনানে আবু দাউদ, হাদীস : ৩৩৬২ (১/৩২২) 

যেসব কাজ রোযাদারের জন্য মাকরূহ নয়

মাসআলা : রোযার হালতে প্রয়োজনে জিহবা দ্বারা কোনো কিছুর স্বাদ নেওয়া বা প্রয়োজনে বাচ্চাদের জন্য খাদ্য চিবানো মাকরূহ নয়। তবে সতর্ক থাকতে হবে, যেন স্বাদ গলার ভেতরে চলে না যায়।

ইবরাহীম নাখায়ী রাহ. রোযাদার মহিলা বাচ্চার জন্য খাদ্য চিবানোকে দোষের বিষয় মনে করতেন না।-মুসান্নাফে আবদুর রাযযাক ৪/২০৭; আলমুহীতুল বুরহানী ৩/৩৫৬; রদ্দুল মুহতার ২/৪১৬

মাসআলা : রোযাদারের জন্য সুরমা লাগানো বা সুগন্ধি ব্যবহার করা মাকরূহ নয়।

আতা রাহ. বলেন, ‘রোযাদারের জন্য সুরমা ব্যবহার করাতে দোষ নেই।’-মুসান্নাফে আবদুর রাযযাক ৪/২০৮; আলবাহরুর রায়েক ২/২৮০

মাসআলা : রোযা অবস্থায়ও মিসওয়াক করা সুন্নত। এমনকি কাঁচা ডাল দ্বারা মিসওয়াক করাও মাকরূহ নয়।

আমির ইবনে রবীয়া রা. বলেন, নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি রোযার হালতে অসংখ্যবার মিসওয়াক করতে দেখেছি।-সহীহ বুখারী ১/২৫৯; মুসান্নাফে আবদুর রাযযাক ৪/২০০

হাসান রাহ.কে রোযা অবস্থায় দিনের শেষে মিসওয়াক করার বিষয়ে জিজ্ঞাসা করা হলে তিনি বলেন, ‘রোযা অবস্থায় দিনের শেষে মিসওয়াক করতে কোনো অসুবিধা নেই। মিসওয়াক পবিত্রতার মাধ্যম। অতএব দিনের শুরুতে এবং শেষেও মিসওয়াক করো।’-মুসান্নাফে আবদুর রাযযাক ৪/২০২

ইবরাহীম রাহ. বলেন, ‘রোযা অবস্থায় দিনের শুরু ও শেষে মিসওয়াক করতে কোনো অসুবিধা নেই।’-প্রাগুক্ত ৪/২০৩

মুজাহিদ রাহ. রোযা অবস্থায় তাজা মিসওয়াক ব্যবহার করাকে দোষণীয় মনে করতেন না। সুফিয়ান সাওরী রাহ. থেকেও অনুরূপ বক্তব্য বর্ণিত আছে।-প্রাগুক্ত ৪/২০২; রদ্দুল মুহতার ২/৪১৯; আলবাহরুর রায়েক ২/২৮১
    
    """)
with right_column:
    img4 = Image.open("images/moon.png")  
    img_resized = img.thumbnail((180, 180))  
    st.image(img4, caption="", use_container_width=False)  
st.subheader("Quran Online")
st.write("Explore the teachings of the Quran.")
st.markdown("[Click here to read the Quran](https://quran.com)")
img2 = Image.open("images/quran.png")  
img_resized = img2.thumbnail((170, 170)) 
st.image(img2, caption="Holi-Quran", use_container_width=False)  

st.write("---")    
st.subheader("Hadith Collection")
st.write("Explore the sayings of the Prophet Muhammad (S).")
st.markdown("[Click here to read the Hadith](https://sunnah.com)")

st.header("Dua for You")
dua_request = st.text_area("Enter your prayer request or dua:")

if dua_request:
    st.write(f"Your prayer request: {dua_request}")


st.subheader("Islamic Learning Video")
st.markdown("Watch this video to deepen your understanding of Islam.")
st.video("https://www.youtube.com/watch?v=_i5_atbwlcI")

st.markdown("""For more Islamic content, follow us on [Facebook](https://facebook.com/MrTan0fficial1).""")
st.write("---")

st.markdown("""
    <style>
        .center-text {
            text-align: center;
            font-size: 24px;
            margin-top: 200px;
        }
    </style>
    <div class="center-text">
        <p><b>Copyright © 2025 Chattogram, Bangladesh. All rights reserved.</b></p>
    </div>
    """, unsafe_allow_html=True)
